
let questions=[
    {
        "question": "你討厭老舊，過時的東西",
        "answers":[
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "你喜歡鄉下",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "你喜歡昆蟲",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "小時候家裡很常拜拜",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "你有多滿意你目前的身材",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "你喜歡畫畫",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "你是個會把回憶記很久的人",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "你體力很好",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "你喜歡拍照",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "你喜歡看武俠小說",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "你待在人多的地方不會覺得不自在",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "你喜歡手做東西",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "你喜歡閱讀",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "你容易覺得不安",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "你喜歡看吃播",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "你很擅長打扮",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "你不太挑食",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "你比起快步調，更喜歡慢慢走",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "你容易被蚊子叮",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "你很注重外表",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "你擅長烹飪",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "比起禮物，你更喜歡收到別人親自寫的卡片",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "你喜歡探究事物真理",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    },
    {
        "question": "你是個有目標的人",
        "answers": [
            [1],
            [2],
            [3],
            [4],
            [5]
        ]
    }
];

let checkAnswers=[
    { "question": [0, 6, 9, 22], "sum": "歷史巡禮"},  //"歷史巡禮"
    { "question": [2, 7, 17, 18], "sum":"生態環境"}, //"生態環境"
    { "question": [1, 8, 15, 19], "sum":"花海農遊"},//"花海農遊": 
    { "question": [5, 11, 12, 21], "sum":"藝文風尚"},// "藝文風尚":
    { "question": [3, 10, 13, 23], "sum":"宗教人文"},//"宗教人文": 
    { "question": [4, 14, 16, 20], "sum":"美食之旅"}//"美食之旅":
];